<template>
    <div>

        <van-nav-bar
                left-arrow
                fixed
                :border="false"
                left-text="返回"
                @click-left="onClickLeft"
        />

        <p>隐私条款</p>
        <h6>我们重视用户的隐私。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
        </h6>
        <h6>您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。如对本《隐私政策》或相关事宜有任何问题，请通过yeyuanshen@128xy.com与我们联系。我们可能收集的信息我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。您提供的信息您在使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件或银行卡号等；您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。其他方分享的您的信息其他方使用我们的服务时所提供有关您的共享信息。我们获取的您的信息。
        </h6>
        <h6>1、本公司向用户提供的服务均是在依"现状"提供，本公司在此明确声明对本服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、准确性、及时性、可持续性等。</h6>
        <h6>2、用户理解并同意自行承担使用本服务的风险，且用户在使用本服务时，应遵循中国法律的相关规定，由于用户行为所造成的任何损害和后果，本公司均不承担除法律有明确规定外的责任。</h6>
        <h6>3、不论在何种情况下，本公司均不对由于网络连接故障、通讯线路、第三方网站、电脑硬件等任何原因给用户造成的任何损失承担除法律有明确规定外的责任。</h6>
    </div>
</template>

<script>
    export default {
        name: "top",
        methods: {
            onClickLeft() {
                this.$router.go(-1)
            }
        }

    }
</script>

<style scoped>
    p{
        margin-top: 50px;
        text-align: center;
        height: 50px;
        border-top:1px solid #aaa;
        border-bottom:1px solid #aaa;
        line-height:50px;
    }
    h6{
        font-weight: normal;

    }
</style>